workshop1/damBreakWithObstacle/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         6;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.75;
maxAlphaCo      1;
maxDeltaT       0.03;

functions
{
  #includeFunc  probes;
  #includeFunc  residuals;
  
  waterLevel
  {
      type      interfaceHeight;
      libs      ("libfieldFunctionObjects.so");
      locations
      (
        (2.66 0 0.5)
        (1    0 0.5)
      );
      alpha     alpha.water;
  }
}
// ************************************************************************* //
